brew "aria2"
brew "bat"
brew "btop"
brew "ffmpeg"
brew "gh"
brew "node"
brew "sevenzip"
brew "speedtest-cli"
brew "transmission-cli"
brew "tree"
brew "unar"
brew "uv"
cask "android-platform-tools"
cask "arc"
cask "bettertouchtool"
cask "chatgpt"
cask "cleanshot"
cask "discord"
cask "ghostty"
cask "godspeed"
cask "google-chrome"
cask "google-drive"
cask "itsycal"
cask "jordanbaird-ice"
cask "miro"
cask "notion"
cask "notion-calendar"
cask "raycast"
cask "rectangle"
cask "slack"
cask "spotify"
cask "stats"
cask "steam"
cask "visual-studio-code"
cask "vlc"
cask "warp"
cask "whatsapp"
vscode "aaronyoung.dark-synthwave-vscode"
vscode "adamraichu.pdf-viewer"
vscode "albert.tabout"
vscode "alefragnani.bookmarks"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "austenc.tailwind-docs"
vscode "bogem.bogems-night-owl"
vscode "bradlc.vscode-tailwindcss"
vscode "cschlosser.doxdocgen"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "dbaeumer.vscode-eslint"
vscode "docsmsft.docs-markdown"
vscode "docsmsft.docs-preview"
vscode "dotjoshjohnson.xml"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "foxundermoon.shell-format"
vscode "frinkr.pdf"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "gitlab.gitlab-workflow"
vscode "golang.go"
vscode "google.geminicodeassist"
vscode "googlecloudtools.cloudcode"
vscode "gruntfuggly.todo-tree"
vscode "howardzuo.vscode-gitk"
vscode "james-yu.latex-workshop"
vscode "janisdd.vscode-edit-csv"
vscode "jeff-hykin.better-cpp-syntax"
vscode "karyfoundation.racket"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-iot.vscode-ros"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.flake8"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "oderwat.indent-rainbow"
vscode "peterj.proto"
vscode "prisma.prisma"
vscode "reactreedev.reactree"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "reditorsupport.r"
vscode "rust-lang.rust-analyzer"
vscode "sdras.night-owl"
vscode "streetsidesoftware.code-spell-checker"
vscode "team-sapling.sapling"
vscode "timonwong.shellcheck"
vscode "tobiah.unity-tools"
vscode "twxs.cmake"
vscode "usernamehw.errorlens"
vscode "vintharas.learn-vim"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "xaver.clang-format"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
vscode "zxh404.vscode-proto3"
